Revit 2027 API
RebarSpliceRules.Dispose Method
Releases all resources used by the RebarSpliceRules
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Dispose()
Public Sub Dispose
public:
virtual void Dispose() sealed
abstract Dispose : unit -> unit
override Dispose : unit -> unit
Implements
IDisposable.Dispose()
See Also
Reference
RebarSpliceRules Class
Autodesk.Revit.DB.Structure Namespace